#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: Mnas-Git
#+DATE: <2019-03-30 Сб>
#+AUTHOR: Nick Matvyeyev
#+EMAIL: mnasoft@gmail.com
#+LANGUAGE: ru
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.1 (Org mode 9.1.9)

Mnas-Git. Проект предназначен для безсетевого способа синхронизации
проектов Common Lisp между различными персональными компьютерами.

* Файлы проекта

#+BEGIN_SRC shell :exports results
for i in `ls ./*.lisp`
do
echo "[[${i}]]"
done 
#+END_SRC

#+RESULTS:
| [[file:./mnas-git.lisp]]      |
| [[file:./mnas-git-test.lisp]] |
| [[file:./mnas-git-vars.lisp]] |
| [[file:./package.lisp]]       |

* Экспортируемые функции проекта Mnas-Git

#+name: function-doc
#+BEGIN_SRC lisp :exports results
    (labels (( str-or-not (x) (if (stringp x) x "-")))
      (mapcar
       #'(lambda (el)
	   (list el (mnas-string:string-replace-all
		     (str-or-not (documentation el 'function)) (format nil "~%") "; ")))
       '(mgit:clone--bare
	 mgit:clone--origin
	 mgit:command mgit:commit-a
	 mgit:help
	 mgit:init mgit:man
	 mgit:remote-readd
	 mgit:sh-command
	 mgit:dialog-remote-readd)))
#+END_SRC

#+RESULTS: function-doc
| MNAS-GIT:CLONE--BARE         | Для каждого репозитория, расположенного в каталоге *clisp-dir-win* текущей ; машины *m-i*, создает список команд, который выполняет клонирование чистого ; репозитория в каталог (concatenate 'string *git-bare-dir* "git-" *m-i*); ; После создания таким образом каталога с чистыми репозиториями его можно; перенести на другую машину для выполнения слияния.; ;    Если опциональный параметр os имеет значение nil,; вывод функции направляется на стандартный вывод при этом функция возврвщает t,; иначе -- вывод направляется в командный файл и затем этот выполняется при этом ; функция возврвшает путь к командному файлу и результат выполнения командного файла;;   Пример использования:; ;;;;(clone--bare); ;;;;(clone--bare t);   Рекоемндации:;   Перед выполнением даной функции следует удалить соответствующий ; каталог:  (concatenate 'string *git-bare-dir* "git-" *m-i*),; содержащий чистые репозитории; |
| MNAS-GIT:CLONE--ORIGIN       | Генерирует сценарий, который выполяет клонирование чистых из репозиториев, для которых ; в каталоге с проектами не нашлось соответствующего проекта,; во виз расположения origin ; ;;;;(clone--origin "mnasoft-00");                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |
| MNAS-GIT:COMMAND             | Для каждого репозитория, расположенного в каталоге *clisp-dir-win* текущей ; машины *m-i*, генерирует сценарий, выполняющий команду git-command.; ;    Если опциональный параметр os имеет значение nil,; вывод функции направляется на стандартный вывод при этом функция возврвщает t,; иначе -- вывод направляется в командный файл и затем этот выполняется при этом ; функция возврвшает путь к командному файлу и результат выполнения командного файла.; ; Пример использования:; ;;;;(command  "git remote remove other"); ;;;;(command  "git remote remove other" t);                                                                                                                                                                                                                                                                                                                                                      |
| MNAS-GIT:COMMIT-A            | Для каждого репозитория, расположенного в каталоге *clisp-dir-win* ; текущей машины *m-i*, генерирует сценарий, выполняющий команду git commit -a.; ; В качестве комментария используется строка предтвляющая,; значение текущей даты и времени.; ; Примеры использования:; ; @begin[lang=lisp](code);  (commit-a); @end(code); ; @begin[lang=lisp](code);  (commit-a t); @end(code); ; @begin[path=sin-cos.png](gnuplot); @begin(verb); plot sin(x), cos(x); @end(verb); @end(gnuplot); ;                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| MNAS-GIT:HELP                | Формирует подсказку с вариантами использования                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
| MNAS-GIT:INIT                | Генерирует bash-сценарий, инициализирующий git репозитории.; ; Примеры использования:;  @begin[lang=lisp](code);   (init); ;   (init t);  @end(code); ;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |
| MNAS-GIT:MAN                 | Формирует строку, содержащую подсказку.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |
| MNAS-GIT:REMOTE-READD        | Для каждого репозитория расположенного в каталоге *clisp-dir-win* создает список команд, который выполняет:; @begin(list); @item(отсоединение от внешних репозиториев (список *m-l*), которые для данной машины *m-i* вожможно имеют неправильное расположение;); @item(присоединение к внешним репозиториям (список *m-l*), которые для данной машины *m-i* должны иметь правильное расположение;); @end(list);    Если опциональный параметр os имеет значение nil,; вывод функции направляется на стандартный вывод при этом функция возврвщает t,; иначе - вывод направляется в командный файл и затем этот выполняется при этом ; функция возврвшает путь к командному файлу и результат выполнения командного файла.; ;    Пример использования:;  @begin[lang=lisp](code);  (prong;   (remote-readd);   (remote-readd t));  @end(code); ;    Рекомендации:; ;    Следует выполнять данную функцию ...;                       |
| MNAS-GIT:SH-COMMAND          | Позволяет выполнить команды                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| MNAS-GIT:DIALOG-REMOTE-READD | Выполняет диалог для указания каталога, в котором находится репозиторий git, ; для пересоздания удаленных репозиториев. ; ; Пример использования:;  @begin[lang=lisp](code);   (dialog-remote-readd);  @end(code); ;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |

* Генерирование документации 

#+BEGIN_SRC lisp
 (codex:document :mnas-git)
#+END_SRC

#+RESULTS:
: NIL

* Примеры использования git                    
** Экспорт изменений в удаленные калалоги      
 #+BEGIN_SRC shell
 for i in cl.net github.com gitlab.com ; do git push $i master; done
 #+END_SRC
 
** Set UTF-8 display for Git GUI differences window

 #+BEGIN_SRC shell
 # Global setting for all you repositories
 git config --global gui.encoding utf-8

 # For one repository only
 git config gui.encoding utf-8
 #+END_SRC

** How to colorize output of git
 #+BEGIN_SRC shell
   git config --global color.ui auto
   git config --global color.branch auto
   git config --global color.status auto
 #+END_SRC


** Install Bash git completion
#+BEGIN_SRC shell
  pacman -S git bash-completion
#+END_SRC

** Typcal .gitignore file
#+BEGIN_SRC shell
  touch .gitignore 
  echo '.directory' >>.gitignore
  echo '*~' >>.gitignore
  echo '*.FASL' >>.gitignore
  echo '*.fasl' >>.gitignore
  echo '*.lisp-temp' >>.gitignore
#+END_SRC


** Typcal .gitattributes file
#+BEGIN_SRC shell
  touch .gitattributes 
  echo '# Set the default behavior, in case people don't have core.autocrlf set' >>.gitignore
  echo '* text=auto' >>.gitignore
  echo '' >>.gitignore
  echo '# Denote all files that are truly binary and should not be modified' >>.gitignore
  echo '*.png binary' >>.gitignore
  echo '*.jpg binary' >>.gitignore
  echo '*.bmp binary' >>.gitignore
  echo '' >>.gitignore
  echo '# Explicitly declare text files you want to always be normalized and converted to native line endings on checkout' >>.gitignore
  echo '*.c* text' >>.gitignore
  echo '*.h* text' >>.gitignore
  echo '' >>.gitignore
  echo '# Declare files that will always have CRLF line endings on checkout' >>.gitignore
  echo '*.sln text eol=crlf' >>.gitignore
  echo '*.txt text eol=crlf' >>.gitignore
  echo '*.md  text eol=crlf' >>.gitignore
  echo '' >>.gitignore
  echo '# Declare files that will always have LF line endings on checkout' >>.gitignore
  echo '# Common Lisp.' >>.gitignore
  echo '*.lisp text eol=lf' >>.gitignore
  echo '*.asd text eol=lf' >>.gitignore
  echo '' >>.gitignore
  echo '# HTML' >>.gitignore
  echo '*.html text eol=lf' >>.gitignore
  echo '' >>.gitignore
  echo '# AutoCad files' >>.gitignore
  echo '# Binary' >>.gitignore
  echo '*.cuix  binary' >>.gitignore
  echo '*.mnr  binary' >>.gitignore
  echo '# CRLF' >>.gitignore
  echo '*.lsp text eol=crlf' >>.gitignore
  echo '*.mnl  text eol=crlf' >>.gitignore
#+END_SRC

* Что сделать
* BASH pull

#+BEGIN_SRC sh
cd /home/namatv/quicklisp/local-projects
COMP="KO11-118383";
CDIR=`pwd`; for i in `find . -name ".git"`
do 
  cd $CDIR/$i
  cd ../
  git pull ${COMP} master
done
#+END_SRC

#+RESULTS:
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |
| Уже | обновлено. |

* Настройка удаленного πι репозитория

#+BEGIN_SRC shell
cd;
#PI="141.101.26.243"
PI="pi"
for i in `find /home/namatv/quicklisp/local-projects/ . -name ".git"`
do 
cd $i/..;
echo $PWD; 
git remote remove pi; 
git remote add pi git@$PI:/opt/git/`basename $PWD`.git; 
done
#+END_SRC

#+RESULTS:
| /home/namatv/quicklisp/local-projects/ltk/enter-box                                  |
| /home/namatv/quicklisp/local-projects/ltk/ltk-exel-lines                             |
| /home/namatv/quicklisp/local-projects/ltk/project-loader                             |
| /home/namatv/quicklisp/local-projects/ltk/ltk-sample                                 |
| /home/namatv/quicklisp/local-projects/ltk/mnas-file-dialog                           |
| /home/namatv/quicklisp/local-projects/ltk/dimensional-chain                          |
| /home/namatv/quicklisp/local-projects/ost/ost-1-00022-80                             |
| /home/namatv/quicklisp/local-projects/_gtd_009                                       |
| /home/namatv/quicklisp/local-projects/emacs-setup                                    |
| /home/namatv/quicklisp/local-projects/msys2-setup                                    |
| /home/namatv/quicklisp/local-projects/gost/gost-7805-70                              |
| /home/namatv/quicklisp/local-projects/gost/gost-25346                                |
| /home/namatv/quicklisp/local-projects/gost/gost-16047-70                             |
| /home/namatv/quicklisp/local-projects/gost/gost-28759-3-90                           |
| /home/namatv/quicklisp/local-projects/gost/gost-16045-70                             |
| /home/namatv/quicklisp/local-projects/gost/piping                                    |
| /home/namatv/quicklisp/local-projects/gost/gost-5927-70                              |
| /home/namatv/quicklisp/local-projects/gost/gost-16043-70                             |
| /home/namatv/quicklisp/local-projects/gost/gost-23518-79                             |
| /home/namatv/quicklisp/local-projects/gost/gost-16048-70                             |
| /home/namatv/quicklisp/local-projects/gost/gost-12821-80                             |
| /home/namatv/quicklisp/local-projects/gost/gost-8-064-79                             |
| /home/namatv/quicklisp/local-projects/gost/gost-6533-78                              |
| /home/namatv/quicklisp/local-projects/qt/qt-spring-dialog                            |
| /home/namatv/quicklisp/local-projects/qt/qtools-intro                                |
| /home/namatv/quicklisp/local-projects/qt/qt-conv                                     |
| /home/namatv/quicklisp/local-projects/qt/sample-01                                   |
| /home/namatv/quicklisp/local-projects/qt/conv                                        |
| /home/namatv/quicklisp/local-projects/fork/xmls                                      |
| /home/namatv/quicklisp/local-projects/fork/xlsx                                      |
| /home/namatv/quicklisp/local-projects/fork/ie3fp-20101006-http                       |
| /home/namatv/quicklisp/local-projects/code-wars/pangramm                             |
| /home/namatv/quicklisp/local-projects/mnas/mnas-logical                              |
| /home/namatv/quicklisp/local-projects/mnas/mnas-heat-transfer                        |
| /home/namatv/quicklisp/local-projects/mnas/ost                                       |
| /home/namatv/quicklisp/local-projects/mnas/mnas-defclass                             |
| /home/namatv/quicklisp/local-projects/mnas/mnas-dim-value                            |
| /home/namatv/quicklisp/local-projects/mnas/mnas-systems                              |
| /home/namatv/quicklisp/local-projects/mnas/exel-read                                 |
| /home/namatv/quicklisp/local-projects/mnas/mnas-string                               |
| /home/namatv/quicklisp/local-projects/mnas/mnas-spring                               |
| /home/namatv/quicklisp/local-projects/mnas/site/mnas-passwd                          |
| /home/namatv/quicklisp/local-projects/mnas/site/mnas-site-template                   |
| /home/namatv/quicklisp/local-projects/mnas/site/mnas-site-control                    |
| /home/namatv/quicklisp/local-projects/mnas/site/mnas-site                            |
| /home/namatv/quicklisp/local-projects/mnas/site/pages/radio-channels                 |
| /home/namatv/quicklisp/local-projects/mnas/site/pages/adiabatic-temperature          |
| /home/namatv/quicklisp/local-projects/mnas/site/pages/site-areas                     |
| /home/namatv/quicklisp/local-projects/mnas/site/pages/page-gost-28759-3-90           |
| /home/namatv/quicklisp/local-projects/mnas/site/pages/mnas-vse-gost                  |
| /home/namatv/quicklisp/local-projects/mnas/site/pages/ecology                        |
| /home/namatv/quicklisp/local-projects/mnas/site/pages/dictionary                     |
| /home/namatv/quicklisp/local-projects/mnas/site/pages/dep11-report                   |
| /home/namatv/quicklisp/local-projects/mnas/site/mnas-site-route                      |
| /home/namatv/quicklisp/local-projects/mnas/site/mnas-dns                             |
| /home/namatv/quicklisp/local-projects/mnas/mnas-graph                                |
| /home/namatv/quicklisp/local-projects/mnas/mnas-list                                 |
| /home/namatv/quicklisp/local-projects/mnas/mnas-path                                 |
| /home/namatv/quicklisp/local-projects/mnas/mnas-git                                  |
| /home/namatv/quicklisp/local-projects/mnas/mnas-format                               |
| /home/namatv/quicklisp/local-projects/mnas/mnas-org-mode                             |
| /home/namatv/quicklisp/local-projects/mnas/mnas-xlsx                                 |
| /home/namatv/quicklisp/local-projects/mnas/mnas-package                              |
| /home/namatv/quicklisp/local-projects/mnas/mnas-hash-table                           |
| /home/namatv/quicklisp/local-projects/_temp/others/qtools/examples/qtools-helloworld |
| /home/namatv/quicklisp/local-projects/_temp/others/emacs_slime_asdf_setup_instr      |
| /home/namatv/quicklisp/local-projects/_temp/others/qt/qt-kepler                      |
| /home/namatv/quicklisp/local-projects/_temp/others/threads-test                      |
| /home/namatv/quicklisp/local-projects/_temp/embeddable-maxima/share/numeric          |
| /home/namatv/quicklisp/local-projects/_temp/embeddable-maxima                        |
| /home/namatv/quicklisp/local-projects/ZM/icacls                                      |
| /home/namatv/quicklisp/local-projects/ZM/dep-stuff                                   |
| /home/namatv/quicklisp/local-projects/ZM/ts-102-102-2017                             |
| /home/namatv/quicklisp/local-projects/ZM/material                                    |
| /home/namatv/quicklisp/local-projects/ZM/smog                                        |
| /home/namatv/quicklisp/local-projects/ZM/v7t90108200d3                               |
| /home/namatv/quicklisp/local-projects/ZM/dt59-dym                                    |
| /home/namatv/quicklisp/local-projects/ZM/tt                                          |
| /home/namatv/quicklisp/local-projects/ZM/t90                                         |
| /home/namatv/quicklisp/local-projects/ZM/n70                                         |
| /home/namatv/quicklisp/local-projects/ZM/t90_klapan_22                               |
| /home/namatv/quicklisp/local-projects/ZM/dg80l3-dg80l4                               |
| /home/namatv/quicklisp/local-projects/ZM/dm80_dg80l3                                 |
| /home/namatv/quicklisp/local-projects/ZM/plan                                        |
| /home/namatv/quicklisp/local-projects/ZM/ugt5000_dual                                |
| /home/namatv/quicklisp/local-projects/ZM/temperature-fild                            |
| /home/namatv/quicklisp/local-projects/ZM/da32                                        |
| /home/namatv/quicklisp/local-projects/ZM/PM/pm-170-algorithm                         |
| /home/namatv/quicklisp/local-projects/ZM/PM/pm-014038001                             |
| /home/namatv/quicklisp/local-projects/ZM/PM/pm-218                                   |
| /home/namatv/quicklisp/local-projects/ZM/PM/pm-170                                   |
| /home/namatv/quicklisp/local-projects/ZM/PM/pm-171                                   |
| /home/namatv/quicklisp/local-projects/ZM/PM/pm-237-algorithm                         |
| /home/namatv/quicklisp/local-projects/ZM/PM/pm-223                                   |
| /home/namatv/quicklisp/local-projects/ZM/ks                                          |
| /home/namatv/quicklisp/local-projects/ZM/889038004                                   |
| /home/namatv/quicklisp/local-projects/ZM/soplo-hvg                                   |
| /home/namatv/quicklisp/local-projects/ZM/t71                                         |
| /home/namatv/quicklisp/local-projects/ZM/ts-gaki-102-024-2018                        |
| /home/namatv/quicklisp/local-projects/ZM/ot-234pm                                    |
| /home/namatv/quicklisp/local-projects/ZM/dg80l3_dogimnoy                             |
| /home/namatv/quicklisp/local-projects/ZM/calendar                                    |
| /home/namatv/quicklisp/local-projects/ZM/M7N_1E                                      |
| /home/namatv/quicklisp/local-projects/clisp/gnuplot                                  |
| /home/namatv/quicklisp/local-projects/clisp/algorithm                                |
| /home/namatv/quicklisp/local-projects/clisp/idelchik                                 |
| /home/namatv/quicklisp/local-projects/clisp/ffmpeg                                   |
| /home/namatv/quicklisp/local-projects/clisp/instrument                               |
| /home/namatv/quicklisp/local-projects/clisp/radio-grab-split                         |
| /home/namatv/quicklisp/local-projects/clisp/areas                                    |
| /home/namatv/quicklisp/local-projects/clisp/varghaftik                               |
| /home/namatv/quicklisp/local-projects/clisp/fors-lic                                 |
| /home/namatv/quicklisp/local-projects/clisp/html-table                               |
| /home/namatv/quicklisp/local-projects/clisp/specification                            |
| /home/namatv/quicklisp/local-projects/clisp/recoder                                  |
| /home/namatv/quicklisp/local-projects/clisp/trender                                  |
| /home/namatv/quicklisp/local-projects/clisp/gases/gases                              |
| /home/namatv/quicklisp/local-projects/clisp/pcl-test                                 |
| /home/namatv/quicklisp/local-projects/clisp/vse-gost                                 |
| /home/namatv/quicklisp/local-projects/clisp/slad                                     |
| /home/namatv/quicklisp/local-projects/clisp/time                                     |
| /home/namatv/quicklisp/local-projects/clisp/experiment-data                          |
| /home/namatv/quicklisp/local-projects/clisp/lst-arr                                  |
| /home/namatv/quicklisp/local-projects/clisp/math                                     |
| /home/namatv/quicklisp/local-projects/clisp/half-div                                 |
| /home/namatv/quicklisp/local-projects/clisp/ecl/ecl_qt                               |
| /home/namatv/quicklisp/local-projects/clisp/dims                                     |
| /home/namatv/quicklisp/local-projects/clisp/convertion                               |
| /home/namatv/quicklisp/local-projects/clisp/windows-regystry                         |
| /home/namatv/quicklisp/local-projects/acad/acad-formats                              |
| /home/namatv/quicklisp/local-projects/acad/vlisp                                     |
| /home/namatv/quicklisp/local-projects/acad/dwg-geom                                  |
| /home/namatv/quicklisp/local-projects/acad/hpgl                                      |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |
| /home/namatv/quicklisp/local-projects/acad/dxf                                       |

* Работа с удаленными репозирориями
** pull

#+BEGIN_SRC shell
cd;
#PI="141.101.26.243"
PI="pi"
for i in `find /home/namatv/quicklisp/local-projects/ . -name ".git"`
do 
cd $i/..;
echo $PWD; 
git pull $PI master;
done
#+END_SRC

** push
#+BEGIN_SRC shell
cd;
#PI="141.101.26.243"
PI="pi"
for i in `find /home/namatv/quicklisp/local-projects/ . -name ".git"`
do 
cd $i/..;
echo $PWD; 
git push $PI master;
done
#+END_SRC
